In [1]:
import pandas as pd
import numpy as np
import scipy as sp
import matplotlib.pyplot as plt

In [2]:
import os, sys
os.getcwd()

'C:\\SPB_Data\\learn ML\\DSN_2018_task'

In [3]:
os.listdir()

['.ipynb_checkpoints',
 'preprocess_train_test.ipynb',
 'SampleSubmission.csv',
 'testdemographics.csv',
 'testperf.csv',
 'testprevloans.csv',
 'testprevloans.zip',
 'traindemographics.csv',
 'trainperf.csv',
 'trainprevloans.csv',
 'trainprevloans.zip']

In [45]:
# train set
train_demographics = pd.read_csv('traindemographics.csv')
trainperf = pd.read_csv('trainperf.csv')
trainprevloans = pd.read_csv('trainprevloans.csv')

# test set
test_demographics = pd.read_csv('testdemographics.csv')
testperf = pd.read_csv('testperf.csv')
testprevloans = pd.read_csv('testprevloans.csv')

In [8]:
# train demographics

def analyse(data, n = 5):
    print('The shape of the data is: ', data.shape)
    print ("")
    print ('The features of the data include are: ',data.keys())
    print ("")
    return data.head(n)

train_demo_head = analyse(train_demographics)
train_demo_head

The shape of the data is:  (4346, 9)

The features of the data include are:  Index(['customerid', 'birthdate', 'bank_account_type', 'longitude_gps',
       'latitude_gps', 'bank_name_clients', 'bank_branch_clients',
       'employment_status_clients', 'level_of_education_clients'],
      dtype='object')

,customerid,birthdate,bank_account_type,longitude_gps,latitude_gps,bank_name_clients,bank_branch_clients,employment_status_clients,level_of_education_clients
0,8a858e135cb22031015cbafc76964ebd,1973-10-10 00:00:00.000000,Savings,3.319219,6.528604,GT Bank,NaN,NaN,NaN
1,8a858e275c7ea5ec015c82482d7c3996,1986-01-21 00:00:00.000000,Savings,3.325598,7.119403,Sterling Bank,NaN,Permanent,NaN
2,8a858e5b5bd99460015bdc95cd485634,1987-04-01 00:00:00.000000,Savings,5.746100,5.563174,Fidelity Bank,NaN,NaN,NaN
3,8a858efd5ca70688015cabd1f1e94b55,1991-07-19 00:00:00.000000,Savings,3.362850,6.642485,GT Bank,NaN,Permanent,NaN
4,8a858e785acd3412015acd48f4920d04,1982-11-22 00:00:00.000000,Savings,8.455332,11.971410,GT Bank,NaN,Permanent,NaN

In [10]:
#trainperf

train_perf = analyse(trainperf)
train_perf

The shape of the data is:  (4368, 10)

The features of the data include are:  Index(['customerid', 'systemloanid', 'loannumber', 'approveddate',
       'creationdate', 'loanamount', 'totaldue', 'termdays', 'referredby',
       'good_bad_flag'],
      dtype='object')

,customerid,systemloanid,loannumber,approveddate,creationdate,loanamount,totaldue,termdays,referredby,good_bad_flag
0,8a2a81a74ce8c05d014cfb32a0da1049,301994762,12,2017-07-25 08:22:56.000000,2017-07-25 07:22:47.000000,30000.0,34500.0,30,NaN,Good
1,8a85886e54beabf90154c0a29ae757c0,301965204,2,2017-07-05 17:04:41.000000,2017-07-05 16:04:18.000000,15000.0,17250.0,30,NaN,Good
2,8a8588f35438fe12015444567666018e,301966580,7,2017-07-06 14:52:57.000000,2017-07-06 13:52:51.000000,20000.0,22250.0,15,NaN,Good
3,8a85890754145ace015429211b513e16,301999343,3,2017-07-27 19:00:41.000000,2017-07-27 18:00:35.000000,10000.0,11500.0,15,NaN,Good
4,8a858970548359cc0154883481981866,301962360,9,2017-07-03 23:42:45.000000,2017-07-03 22:42:39.000000,40000.0,44000.0,30,NaN,Good

In [12]:
#trainprevloans
train_pref_loans = analyse(trainprevloans)
train_pref_loans

The shape of the data is:  (18183, 12)

The features of the data include are:  Index(['customerid', 'systemloanid', 'loannumber', 'approveddate',
       'creationdate', 'loanamount', 'totaldue', 'termdays', 'closeddate',
       'referredby', 'firstduedate', 'firstrepaiddate'],
      dtype='object')

,customerid,systemloanid,loannumber,approveddate,creationdate,loanamount,totaldue,termdays,closeddate,referredby,firstduedate,firstrepaiddate
0,8a2a81a74ce8c05d014cfb32a0da1049,301682320,2,2016-08-15 18:22:40.000000,2016-08-15 17:22:32.000000,10000.0,13000.0,30,2016-09-01 16:06:48.000000,NaN,2016-09-14 00:00:00.000000,2016-09-01 15:51:43.000000
1,8a2a81a74ce8c05d014cfb32a0da1049,301883808,9,2017-04-28 18:39:07.000000,2017-04-28 17:38:53.000000,10000.0,13000.0,30,2017-05-28 14:44:49.000000,NaN,2017-05-30 00:00:00.000000,2017-05-26 00:00:00.000000
2,8a2a81a74ce8c05d014cfb32a0da1049,301831714,8,2017-03-05 10:56:25.000000,2017-03-05 09:56:19.000000,20000.0,23800.0,30,2017-04-26 22:18:56.000000,NaN,2017-04-04 00:00:00.000000,2017-04-26 22:03:47.000000
3,8a8588f35438fe12015444567666018e,301861541,5,2017-04-09 18:25:55.000000,2017-04-09 17:25:42.000000,10000.0,11500.0,15,2017-04-24 01:35:52.000000,NaN,2017-04-24 00:00:00.000000,2017-04-24 00:48:43.000000
4,8a85890754145ace015429211b513e16,301941754,2,2017-06-17 09:29:57.000000,2017-06-17 08:29:50.000000,10000.0,11500.0,15,2017-07-14 21:18:43.000000,NaN,2017-07-03 00:00:00.000000,2017-07-14 21:08:35.000000

In [16]:
# confirm if the the customer id of trainprevloans, trainperf and train demographics are the same

def confirm_id(data1,data2,data3,id,confirm = 'customerid'):
    compute_data1, compute_data2,compute_data3, final= data1[confirm],data2[confirm],data3[confirm], True
    if (id in compute_data1) & (id in compute_data2) & (id in compute_data3):
        final = True
    else:
        final = False
    return final

def check_id(data1,data2,data3, confirm = 'customerid'):
    check_list, value, hope = [], True,None
    for k in data1[confirm]: 
        value = confirm_id(data1,data2,data3,k, confirm = 'customerid')
        check_list.append(value)
    if np.unique(np.array(check_list)) == True:
        hope = "Checked and they are confirmed to be present"
    else:
        hope = "Not all are confirmed to be present"
    return hope

check_id(trainprevloans,trainperf,train_demographics, confirm = 'customerid')

'Not all are confirmed to be present'

In [17]:
check_id(trainperf,train_demographics,trainprevloans, confirm = 'customerid')

'Not all are confirmed to be present'

In [18]:
check_id(train_demographics,trainprevloans,trainperf, confirm = 'customerid')

'Not all are confirmed to be present'

# exploring the traindemographics

In [20]:
# exploring the traindemographics
train_demographics.head()

,customerid,birthdate,bank_account_type,longitude_gps,latitude_gps,bank_name_clients,bank_branch_clients,employment_status_clients,level_of_education_clients
0,8a858e135cb22031015cbafc76964ebd,1973-10-10 00:00:00.000000,Savings,3.319219,6.528604,GT Bank,NaN,NaN,NaN
1,8a858e275c7ea5ec015c82482d7c3996,1986-01-21 00:00:00.000000,Savings,3.325598,7.119403,Sterling Bank,NaN,Permanent,NaN
2,8a858e5b5bd99460015bdc95cd485634,1987-04-01 00:00:00.000000,Savings,5.746100,5.563174,Fidelity Bank,NaN,NaN,NaN
3,8a858efd5ca70688015cabd1f1e94b55,1991-07-19 00:00:00.000000,Savings,3.362850,6.642485,GT Bank,NaN,Permanent,NaN
4,8a858e785acd3412015acd48f4920d04,1982-11-22 00:00:00.000000,Savings,8.455332,11.971410,GT Bank,NaN,Permanent,NaN

In [21]:
# traindemographics
# the customer id is the primary key used to merge to other data
train_demographics.shape

(4346, 9)

In [34]:
import re
p =re.compile('[0-9]?')
m = p.match("1973-10-10")
m.group()
m.start(), m.end()
m.span()

(0, 1)

In [46]:
import re

def birthyears(data, column, current_year):
    birth_list = []
    for k in data[column]:
        val = k[0:4]
        birth_list.append(current_year -int(val))
    return birth_list

train_demographics['birthdate'] = birthyears(train_demographics, 'birthdate', 2018)

In [47]:
demographics = train_demographics

unique_account_type = [np.unique(demographics['bank_account_type'])]

import warnings
warnings.filterwarnings("ignore")

def encode_account(key):
    if key == 'Current':
        data = 1
    elif key == 'Savings':
        data = 2
    else:
        data = 3
    return data

demographics['bank_account_type'] = demographics['bank_account_type'].apply(encode_account)

In [49]:
# bank names
vest = pd.get_dummies(demographics, 'bank_name_clients')

In [51]:
[np.unique(demographics['bank_name_clients'])]

[array(['Access Bank', 'Diamond Bank', 'EcoBank', 'FCMB', 'Fidelity Bank',
        'First Bank', 'GT Bank', 'Heritage Bank', 'Keystone Bank',
        'Skye Bank', 'Stanbic IBTC', 'Standard Chartered', 'Sterling Bank',
        'UBA', 'Union Bank', 'Unity Bank', 'Wema Bank', 'Zenith Bank'], dtype=object)]

In [57]:
demographic_create = demographics
demographic_create = demographic_create.drop(['latitude_gps','longitude_gps'], axis = 1)

In [63]:
demographic_create = pd.get_dummies(demographic_create, columns =['bank_name_clients']).head()

In [69]:
[np.unique(demographic_create['bank_branch_clients'])]
demographic_create = demographic_create.drop('bank_branch_clients', axis = 1)

In [70]:
demographic_create['employment_status_clients'].value_counts()
demographic_create = demographic_create.drop('employment_status_clients', axis = 1)

In [73]:
demographic_create['level_of_education_clients'].value_counts()
demographic_create = demographic_create.drop('level_of_education_clients', axis =1)

In [74]:
demographic_create_final = demographic_create
demographic_create_final.head()

,customerid,birthdate,bank_account_type,bank_name_clients_Access Bank,bank_name_clients_Diamond Bank,bank_name_clients_EcoBank,bank_name_clients_FCMB,bank_name_clients_Fidelity Bank,bank_name_clients_First Bank,bank_name_clients_GT Bank,...,bank_name_clients_Keystone Bank,bank_name_clients_Skye Bank,bank_name_clients_Stanbic IBTC,bank_name_clients_Standard Chartered,bank_name_clients_Sterling Bank,bank_name_clients_UBA,bank_name_clients_Union Bank,bank_name_clients_Unity Bank,bank_name_clients_Wema Bank,bank_name_clients_Zenith Bank
0,8a858e135cb22031015cbafc76964ebd,45,2,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
1,8a858e275c7ea5ec015c82482d7c3996,32,2,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
2,8a858e5b5bd99460015bdc95cd485634,31,2,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3,8a858efd5ca70688015cabd1f1e94b55,27,2,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
4,8a858e785acd3412015acd48f4920d04,36,2,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0

# exploring trainperf

In [75]:
# exploring trainperf
trainperf.head()

,customerid,systemloanid,loannumber,approveddate,creationdate,loanamount,totaldue,termdays,referredby,good_bad_flag
0,8a2a81a74ce8c05d014cfb32a0da1049,301994762,12,2017-07-25 08:22:56.000000,2017-07-25 07:22:47.000000,30000.0,34500.0,30,NaN,Good
1,8a85886e54beabf90154c0a29ae757c0,301965204,2,2017-07-05 17:04:41.000000,2017-07-05 16:04:18.000000,15000.0,17250.0,30,NaN,Good
2,8a8588f35438fe12015444567666018e,301966580,7,2017-07-06 14:52:57.000000,2017-07-06 13:52:51.000000,20000.0,22250.0,15,NaN,Good
3,8a85890754145ace015429211b513e16,301999343,3,2017-07-27 19:00:41.000000,2017-07-27 18:00:35.000000,10000.0,11500.0,15,NaN,Good
4,8a858970548359cc0154883481981866,301962360,9,2017-07-03 23:42:45.000000,2017-07-03 22:42:39.000000,40000.0,44000.0,30,NaN,Good

In [78]:
trainperf.shape

(4368, 10)

In [82]:
trainperf_create = trainperf
referred_dict = dict(trainperf_create['referredby'].value_counts())
print ('we have a total of ',sum(referred_dict.values()),' referred out of', trainperf.shape[0])

we have a total of  587  referred out of 4368

In [83]:
trainperf_create = trainperf_create.drop('referredby', axis =1)

In [85]:
import datetime
datetime.datetime.now()

datetime.datetime(2018, 10, 12, 4, 10, 17, 157721)

In [94]:
time_stamp = trainperf_create['approveddate'][1].strip('-')
time_stamp

'2017-07-05 17:04:41.000000'

In [89]:
import pytz, time
current_datetime = datetime.datetime.now()
time.strftime('%d %M %Y')

In [97]:
# neglecting the time stamp
trainperf_create = trainperf_create.drop('approveddate', axis =1)
trainperf_create = trainperf_create.drop('creationdate', axis =1)

In [98]:
trainperf_create.head()

,customerid,systemloanid,loannumber,loanamount,totaldue,termdays,good_bad_flag
0,8a2a81a74ce8c05d014cfb32a0da1049,301994762,12,30000.0,34500.0,30,Good
1,8a85886e54beabf90154c0a29ae757c0,301965204,2,15000.0,17250.0,30,Good
2,8a8588f35438fe12015444567666018e,301966580,7,20000.0,22250.0,15,Good
3,8a85890754145ace015429211b513e16,301999343,3,10000.0,11500.0,15,Good
4,8a858970548359cc0154883481981866,301962360,9,40000.0,44000.0,30,Good

# exploring the previous loan

In [99]:
trainprevloans.head()

,customerid,systemloanid,loannumber,approveddate,creationdate,loanamount,totaldue,termdays,closeddate,referredby,firstduedate,firstrepaiddate
0,8a2a81a74ce8c05d014cfb32a0da1049,301682320,2,2016-08-15 18:22:40.000000,2016-08-15 17:22:32.000000,10000.0,13000.0,30,2016-09-01 16:06:48.000000,NaN,2016-09-14 00:00:00.000000,2016-09-01 15:51:43.000000
1,8a2a81a74ce8c05d014cfb32a0da1049,301883808,9,2017-04-28 18:39:07.000000,2017-04-28 17:38:53.000000,10000.0,13000.0,30,2017-05-28 14:44:49.000000,NaN,2017-05-30 00:00:00.000000,2017-05-26 00:00:00.000000
2,8a2a81a74ce8c05d014cfb32a0da1049,301831714,8,2017-03-05 10:56:25.000000,2017-03-05 09:56:19.000000,20000.0,23800.0,30,2017-04-26 22:18:56.000000,NaN,2017-04-04 00:00:00.000000,2017-04-26 22:03:47.000000
3,8a8588f35438fe12015444567666018e,301861541,5,2017-04-09 18:25:55.000000,2017-04-09 17:25:42.000000,10000.0,11500.0,15,2017-04-24 01:35:52.000000,NaN,2017-04-24 00:00:00.000000,2017-04-24 00:48:43.000000
4,8a85890754145ace015429211b513e16,301941754,2,2017-06-17 09:29:57.000000,2017-06-17 08:29:50.000000,10000.0,11500.0,15,2017-07-14 21:18:43.000000,NaN,2017-07-03 00:00:00.000000,2017-07-14 21:08:35.000000

In [100]:
train_prev_create = trainprevloans
train_prev_create = train_prev_create.drop(['approveddate','creationdate','closeddate','referredby','firstduedate','firstrepaiddate'], axis = 1)

In [101]:
train_prev_create.head()

,customerid,systemloanid,loannumber,loanamount,totaldue,termdays
0,8a2a81a74ce8c05d014cfb32a0da1049,301682320,2,10000.0,13000.0,30
1,8a2a81a74ce8c05d014cfb32a0da1049,301883808,9,10000.0,13000.0,30
2,8a2a81a74ce8c05d014cfb32a0da1049,301831714,8,20000.0,23800.0,30
3,8a8588f35438fe12015444567666018e,301861541,5,10000.0,11500.0,15
4,8a85890754145ace015429211b513e16,301941754,2,10000.0,11500.0,15

In [102]:
train_prev_create.shape

(18183, 6)